app/views/home/categories.html.erb

  <% @categories.each_with_index do |category, index| %>
    <% main_dishes = @restaurant.items.select { |item| item.dish.name == category } %>
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."restaurant_id" = $1  [["restaurant_id", 1]]