app/views/dishes/show.html.erb

<div>
  <% @dish.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."dish_id" = $1  [["dish_id", 9]]