app/views/restaurants/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."restaurant_id" = $1  [["restaurant_id", 1]]
---

  <% @restaurant.items.each do |item| %>