app/controllers/dishes_controller.rb

  def show
    @dish = Dish.find(params[:id])
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save
---
INSERT INTO "dishes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "camila"], ["created_at", "2023-05-18 05:06:58.451262"], ["updated_at", "2023-05-18 05:06:58.451262"]]

  def destroy
    @dish.items.destroy_all
    @dish.destroy
---
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 7]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 920592244]]

    def set_dish
      @dish = Dish.find(params[:id])
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]