app/controllers/home_controller.rb

  def index
    @top_restaurants = Restaurant.order(items_count: :desc).limit(3)
---
SELECT "restaurants".* FROM "restaurants" ORDER BY "restaurants"."items_count" DESC LIMIT $1  [["LIMIT", 3]]

  def categories
    @categories = Dish.distinct.pluck(:name).sort_by do |category|
      case category
      when 'Entradas'
        1
      when 'Platos Principales'
        2
      when 'Postres'
        3
      else
        4
      end
    end
    @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT DISTINCT "dishes"."name" FROM "dishes"
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]