app/controllers/items_controller.rb

  def new
    @item = Item.new
    @dishes = Dish.all
    @restaurants = Restaurant.all
---
SELECT "dishes".* FROM "dishes"
SELECT "restaurants".* FROM "restaurants"

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "price", "callories", "created_at", "updated_at", "restaurant_id", "dish_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "for you"], ["price", 5555], ["callories", 222], ["created_at", "2023-05-18 05:51:47.816654"], ["updated_at", "2023-05-18 05:51:47.816654"], ["restaurant_id", 2], ["dish_id", 3]]