app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Camila"], ["address", "New York 111"], ["created_at", "2023-05-13 03:44:07.162299"], ["updated_at", "2023-05-13 03:44:07.162299"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 920592244]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 648827877]]
---
  def destroy
    @restaurant.items.destroy_all